-- phpMyAdmin SQL Dump
-- version 4.7.3
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Дек 04 2017 г., 01:07
-- Версия сервера: 5.6.37
-- Версия PHP: 5.6.31

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `test_blog`
--

-- --------------------------------------------------------

--
-- Структура таблицы `comments`
--

CREATE TABLE `comments` (
  `id` int(11) NOT NULL,
  `author_name` varchar(100) NOT NULL,
  `coment` mediumtext NOT NULL,
  `data` date NOT NULL,
  `id_entry` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `comments`
--

INSERT INTO `comments` (`id`, `author_name`, `coment`, `data`, `id_entry`) VALUES
(1, 'Зал Макси', 'Комментарий 1 - фыврывпажлыдв фыов лфыролдв лфыовг ыфргв фыов рфоыв фырв рфыдлв олопоф', '2017-12-02', 1),
(2, 'Клименко Олег', 'Коминтарий 2 - фждыовлыфрв фыорлв фы дловралывф да офдвардфжвоадгфврао рфолвра фаввф  афва фва фа фва ', '2017-12-02', 1),
(3, 'Ирина', 'Комент 1 - ыфврлофыв ыфв оыфрв орыфов рофыв фы вф ыв фыв ыфв фы вфыв ыф', '2017-12-01', 2),
(4, 'Андрюха', 'Комент 2 - фылвл фынивфы грвфырпавыарфлырврфы  все гавно', '2017-12-01', 2),
(5, 'Сергей Шебаниц', 'Супер', '2017-12-02', 2),
(6, 'Сергей Шебаниц', 'Фигня', '2017-12-02', 2),
(7, '2', '2', '2017-12-03', 1),
(8, '2', '3', '2017-12-03', 2),
(9, '3', '3', '2017-12-03', 2),
(10, '2', '2', '2017-12-04', 4),
(11, '3', '3', '2017-12-04', 4),
(12, 'Кто то', 'фышвфыво фыво офыв фыв фыв ', '2017-12-04', 5),
(13, 'я', 'бла бла бла', '2017-12-04', 3);

-- --------------------------------------------------------

--
-- Структура таблицы `entry`
--

CREATE TABLE `entry` (
  `id` int(11) NOT NULL,
  `authors_name` varchar(100) NOT NULL,
  `content_list` mediumtext NOT NULL,
  `data` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `entry`
--

INSERT INTO `entry` (`id`, `authors_name`, `content_list`, `data`) VALUES
(1, 'Шебаниц Виталий', 'Пубилкация 1 фывофлыв аыва ыва ыва ываываывпыва выа ыва ываывп ыап ыап ыап ыавп выап авптыв т аьываыватьывиаттывьа   ыва ыватывр арыва ыв паыва пыва быв оаолывр', '2017-12-02'),
(2, 'Кищенко Дмитрий', 'Публикация 2 - фывывлоапфыыодл дфы ар фвыаовфр арфпвырапфыовл алывп алофывагфыв арвыф авыф нагвфа гфывнавыфнафвы авфыав авф афв афварпфв апфвпа пфва пфваф р', '2017-12-01'),
(3, 'Георгий Валериевич', 'Бла бла бла, здесь находится какой то текст', '2017-12-03'),
(4, 'в', 'в', '2017-12-04'),
(5, 'Инкогнито', 'Какой то бред', '2017-12-04'),
(7, 'реп', 'вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв вввввввввввввввввввввввввввв ', '2017-12-04');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `comments`
--
ALTER TABLE `comments`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `entry`
--
ALTER TABLE `entry`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `comments`
--
ALTER TABLE `comments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;
--
-- AUTO_INCREMENT для таблицы `entry`
--
ALTER TABLE `entry`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
